# 5  Getting Started with pandas

Throughout the remaining chapters of the book, pandas will be a central focus. It offers data structures and tools for manipulating data in Python, streamlining the processes of data cleaning and analysis. pandas is commonly utilized alongside numerical computing tools like NumPy and SciPy, analytical libraries such as statsmodels and scikit-learn, and data visualization libraries like matplotlib. While pandas borrows coding styles from NumPy, its primary distinction lies in its specialization for working with tabular or diverse data, unlike NumPy, which excels with homogeneously typed numerical array data.

Since its transition to an open-source project in 2010, pandas has evolved into a substantial library applicable to a wide range of real-world scenarios. With a developer community exceeding 2,500 contributors, the project has grown significantly, benefitting from the collective expertise of individuals who have actively used it to address their day-to-day data challenges. The thriving pandas developer and user communities have played a pivotal role in the success of the library.

For the remainder of the book, We'll stick to the following import conventions for NumPy and pandas:

```python
In [1]: import numpy as np

In [2]: import pandas as pd
```

So, whenever you encounter `pd.` in the code, it's essentially shorthand for pandas. To simplify things further, you might find it convenient to bring Series and DataFrame directly into the local namespace, considering their frequent usage:

```python
In [3]: from pandas import Series, DataFrame
```

In [1]:
import numpy as np
import pandas as pd

In [2]:
from pandas import Series, DataFrame

## 5.1 Introduction to pandas Data Structures

Getting started with pandas involves becoming acquainted with its two primary data structures: Series and DataFrame. While they may not be a one-size-fits-all solution, they serve as a robust foundation for a diverse array of data tasks.

### Series
A Series is akin to a one-dimensional array, containing a sequence of values (similar to NumPy types) and an associated array of data labels called its index. The simplest Series is created with just an array of data:

```python
In [14]: obj = pd.Series([4, 7, -5, 3])

In [15]: obj
Out[15]: 
0    4
1    7
2   -5
3    3
dtype: int64
```

The index is automatically generated as integers when not specified. You can access the array representation and index using `obj.array` and `obj.index` respectively.

```python
In [16]: obj.array
Out[16]: 
<PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [17]: obj.index
Out[17]: RangeIndex(start=0, stop=4, step=1)
```

You can create a Series with a labeled index:

```python
In [18]: obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])
```

Accessing values using labels is possible, and operations maintain the link between index and values:

```python
In [21]: obj2["a"]
Out[21]: -5

In [24]: obj2[obj2 > 0]
Out[24]: 
d    6
b    7
c    3
dtype: int64
```

A Series can be viewed as a fixed-length, ordered dictionary. You can create one from a dictionary or convert it back using `to_dict()`.

```python
In [32]: obj3 = pd.Series({"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000})
```

Handling missing data, labeled arithmetic operations, and assigning names to the Series and its index are essential aspects explored in this introduction to Series. The alignment of data based on index labels during arithmetic operations is a feature reminiscent of a join operation in databases.

```python
In [42]: obj3 + obj4
Out[42]: 
California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64
```

Lastly, both the Series object and its index can have a name attribute, integrating with other pandas functionalities. The index of a Series can be modified in place by assignment.

Both the Series object and its index come equipped with a name attribute, seamlessly integrating with various aspects of pandas functionality:

```python
In [43]: obj4.name = "population"

In [44]: obj4.index.name = "state"

In [45]: obj4
Out[45]: 
state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64
```

Assigning a name to the Series object as a whole (`obj4.name`) and naming its index (`obj4.index.name`) enhances clarity, especially when dealing with multiple Series in a broader analysis or when combining data from different sources.

Additionally, you can modify a Series's index directly through assignment:

```python
In [46]: obj
Out[46]: 
0    4
1    7
2   -5
3    3
dtype: int64

In [47]: obj.index = ["Bob", "Steve", "Jeff", "Ryan"]

In [48]: obj
Out[48]: 
Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64
```

This flexibility allows you to personalize the index to better reflect the context of your data, making it more meaningful and interpretable in your analysis.

In [3]:
import numpy as np
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc("figure", figsize=(10, 6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
pd.options.display.max_columns = 20
pd.options.display.max_colwidth = 80
np.set_printoptions(precision=4, suppress=True)

In [4]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])
obj2
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj2["a"]

-5

In [17]:
obj2["d"] = 6
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [18]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64

In [19]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [20]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [21]:
import numpy as np
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [9]:
"b" in obj2
"e" in obj2

In [10]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [11]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [12]:
states = ["California", "Ohio", "Oregon", "Texas"]
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [13]:
pd.isna(obj4)
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [14]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [15]:
obj3
obj4
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [16]:
obj4.name = "population"
obj4.index.name = "state"
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [17]:
obj
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### Exercise:

1. **Series with Labels:**
   - Create a new Series named `obj2` with the values [4, 7, -5, 3] with labels ["d", "b", "a", "c"]. Display the Series and its index.

2. **Accessing and Modifying Elements:**
   - Retrieve the value associated with the label "a" from `obj2`.
   - Change the value associated with the label "d" in `obj2` to 6.
   - Display the subset of `obj2` containing values with labels ["c", "a", "d"].

3. **NumPy-like Operations on Series:**
   - Display the elements of `obj2` that are greater than 0.
   - Multiply all elements of `obj2` by 2.
   - Calculate the exponential of each element in `obj2` using NumPy's `exp` function.

4. **Series as a Dictionary:**
   - Check if the label "b" is present in `obj2`.
   - Check if the label "e" is present in `obj2`.
   - Create a Series named `obj3` from the dictionary `sdata` provided in the material. Display the resulting Series.

5. **Handling Missing Data:**
   - Display a boolean Series indicating whether each element in `obj4` is missing (NaN).
   - Display a boolean Series indicating whether each element in `obj4` is not missing.

7. **Series Attributes:**
   - Give the Series `obj4` the name "population" and name its index "state". Display the updated Series.

7. **Changing Index Labels:**
   - Change the index of the `obj` Series to ["Bob", "Steve", "Jeff", "Ryan"]. Display the updated Series.

### DataFrame

A DataFrame is a structured representation of tabular data, resembling a two-dimensional table, containing columns with different data types such as numeric, string, or Boolean values. It consists of both row and column indices, akin to a dictionary where each column is a Series sharing the same index.

The DataFrame can also be utilized for organizing data beyond two dimensions by employing hierarchical indexing, which we'll delve into in Chapter 8: Data Wrangling: Join, Combine, and Reshape, and is foundational for more advanced data manipulation functionalities in pandas.

Constructing a DataFrame can be achieved through various methods, but one common approach is using a dictionary comprising lists or NumPy arrays of equal length:

```python
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
```

The resulting DataFrame is automatically assigned an index, akin to Series, and the columns are arranged based on the order of keys in the data dictionary, preserving their insertion order:

```
    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2
```

In [18]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

The `head` method in pandas DataFrame retrieves the first five rows of the DataFrame. This is useful when dealing with large datasets as it provides a concise preview of the data. For example, given a DataFrame named `frame`, calling `frame.head()` will return the first five rows as shown below:

```
   state  year  pop
0   Ohio  2000  1.5
1   Ohio  2001  1.7
2   Ohio  2002  3.6
3 Nevada  2001  2.4
4 Nevada  2002  2.9
```

Conversely, the `tail` method retrieves the last five rows of the DataFrame. This can be helpful for checking the end of the dataset. Similarly, given the same DataFrame `frame`, calling `frame.tail()` will return the last five rows:

```
   state  year  pop
1   Ohio  2001  1.7
2   Ohio  2002  3.6
3 Nevada  2001  2.4
4 Nevada  2002  2.9
5 Nevada  2003  3.2
```

When creating a DataFrame, you can specify the order of columns using the `columns` parameter. This allows you to arrange the columns as desired. For example, if `data` is a dictionary containing the data, you can create a DataFrame with specific column order like this:

```
pd.DataFrame(data, columns=["year", "state", "pop"])
```

This will result in a DataFrame where the columns are arranged as specified.

If you provide a column name that is not present in the dictionary used to create the DataFrame, it will appear with missing values in the resulting DataFrame. For instance, if you create a DataFrame `frame2` with an additional column named "debt", but it's not present in the original data, it will show up with NaN values:

```
   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN
```

Columns in a DataFrame can be accessed as Series using either dictionary-like notation (`frame2["state"]`) or dot attribute notation (`frame2.state`). However, the latter method (`frame2.column`) only works when the column name is a valid Python variable name and does not conflict with any DataFrame method names. It's worth noting that both methods return Series objects with the same index as the DataFrame, and their name attributes are appropriately set.

In [19]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [20]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [21]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [22]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [24]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [25]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [27]:
frame2[1]

KeyError: 1

Rows can be retrieved either by their position or by their label using the special `iloc` and `loc` attributes, respectively. These methods allow for more flexible and precise row selection. 

For example, using the `loc` attribute on a DataFrame like `frame2`, you can retrieve a row by its label. In the provided code snippet, `frame2.loc[1]` returns the row labeled '1':

```
year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object
```

Similarly, the `iloc` attribute allows for row retrieval by position. In the given code, `frame2.iloc[2]` retrieves the row at position 2 (zero-indexed):

```
year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object
```

Both `loc` and `iloc` provide powerful methods for accessing specific rows in a DataFrame, enabling tasks such as filtering and manipulation based on either labels or positions.

In [28]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [29]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

Columns in a pandas DataFrame can be easily modified by assignment. For instance, you can assign a scalar value or an array of values to a column. Here are a few examples:

```python
# Assigning a scalar value to the 'debt' column
frame2["debt"] = 16.5

# Assigning an array of values to the 'debt' column
frame2["debt"] = np.arange(6.)

# Assigning a Series to the 'debt' column
val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5])
frame2["debt"] = val
```

In each case, the DataFrame `frame2` is updated accordingly. When assigning lists, arrays, or Series to a column, the length of the value must match the length of the DataFrame. If a Series is assigned, its labels will be aligned with the DataFrame's index, and missing values will be inserted for any index values not present in the DataFrame.

Additionally, you can create new columns by assigning values to a column that doesn't exist. For instance, in the code snippet below, a new column named 'eastern' is created based on a condition:

```python
frame2["eastern"] = frame2["state"] == "Ohio"
```

However, it's important to note that new columns cannot be created using the dot attribute notation (`frame2.eastern`). 

If you need to delete columns, you can use the `del` keyword, similar to deleting keys in a dictionary. For example, to remove the 'eastern' column:

```python
del frame2["eastern"]
```

After deletion, you can verify the columns of the DataFrame using the `columns` attribute (`frame2.columns`). 

It's crucial to be cautious when modifying columns, especially since modifications to a Series obtained from a DataFrame view will reflect in the DataFrame itself. If you need to modify a Series without affecting the original DataFrame, you can explicitly copy the Series using the `copy()` method.

In [30]:
frame2["debt"] = 16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [31]:
frame2["debt"] = np.arange(6.)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [32]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])
frame2["debt"] = val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [33]:
frame2["eastern"] = frame2["state"] == "Ohio"
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

In [34]:
del frame2["eastern"]
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

Another common data structure is a nested dictionary of dictionaries. Here, the outer dictionary keys typically represent the column names, while the inner dictionary keys serve as row indices, with their corresponding values being the data points.

For example, consider the following nested dictionary named `populations`:

In [35]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}}

If you pass this nested dictionary to a pandas DataFrame, pandas will interpret the outer dictionary keys as the columns and the inner keys as the row indices. The resulting DataFrame, `frame3`, will look like this:

In [36]:
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

Here, the columns represent the states ("Ohio" and "Nevada"), and the rows correspond to the years (2000, 2001, and 2002). The values in the DataFrame are filled according to the data provided in the nested dictionary. For instance, in the year 2000, the population of Ohio is 1.5, while no population data is available for Nevada in that year (hence, it's represented as NaN, meaning "Not a Number").

You can transpose a DataFrame, swapping its rows and columns, using syntax similar to that of a NumPy array. For instance, calling `.T` on the DataFrame `frame3` will transpose it:

```python
frame3.T
```

This operation results in the following transposed DataFrame:

```
        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9
```

It's worth noting a caveat: transposing a DataFrame discards column data types if the columns do not all have the same data type. Therefore, transposing and then transposing back may result in the loss of the previous type information, making the columns become arrays of pure Python objects.

When creating a DataFrame from a nested dictionary with an explicit index, the keys in the inner dictionaries are combined to form the index in the result. For example:

```python
pd.DataFrame(populations, index=[2001, 2002, 2003])
```

This will produce a DataFrame with the specified index:

```
      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN
```

Dictionaries of Series are handled similarly. For instance, if you have a dictionary `pdata` where the values are Series, you can create a DataFrame from it:

```python
pdata = {"Ohio": frame3["Ohio"][:-1],
         "Nevada": frame3["Nevada"][:2]}
pd.DataFrame(pdata)
```

This results in the following DataFrame:

```
      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
```

For a comprehensive list of data inputs that you can pass to the DataFrame constructor, refer to Table 5.1 in the documentation. This table outlines various types of data inputs and how they are interpreted when creating a DataFrame.



| Type                                    | Notes                                                                                                           |
|-----------------------------------------|-----------------------------------------------------------------------------------------------------------------|
| 2D ndarray                              | A matrix of data, passing optional row and column labels                                                       |
| Dictionary of arrays, lists, or tuples | Each sequence becomes a column in the DataFrame; all sequences must be the same length                         |
| NumPy structured/record array           | Treated as the “dictionary of arrays” case                                                                     |
| Dictionary of Series                   | Each value becomes a column; indexes from each Series are unioned together to form the result’s row index if no explicit index is passed |
| Dictionary of dictionaries             | Each inner dictionary becomes a column; keys are unioned to form the row index as in the “dictionary of Series” case |
| List of dictionaries or Series         | Each item becomes a row in the DataFrame; unions of dictionary keys or Series indexes become the DataFrame’s column labels |
| List of lists or tuples                | Treated as the “2D ndarray” case                                                                               |
| Another DataFrame                      | The DataFrame’s indexes are used unless different ones are passed                                              |
| NumPy MaskedArray                      | Like the “2D ndarray” case except masked values are missing in the DataFrame result                            |

In [32]:
frame3.T

In [33]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

In [34]:
pdata = {"Ohio": frame3["Ohio"][:-1],
         "Nevada": frame3["Nevada"][:2]}
pd.DataFrame(pdata)

In [35]:
frame3.index.name = "year"
frame3.columns.name = "state"
frame3

Unlike Series objects, DataFrames do not have a `name` attribute. However, DataFrames provide a method called `to_numpy()` that allows you to retrieve the data stored in the DataFrame as a two-dimensional NumPy ndarray.

For example, calling `frame3.to_numpy()` on a DataFrame named `frame3` will return a two-dimensional ndarray containing the DataFrame's data. Here's an illustration:

```python
frame3.to_numpy()
```

The output will resemble the following ndarray:

```
array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])
```

It's important to note that if the DataFrame's columns contain data of different types, the data type of the resulting ndarray will be chosen to accommodate all of the columns. This means that if the columns have mixed data types, the resulting ndarray will have the `dtype` set to `object`, which essentially treats all elements as Python objects. 

For instance, calling `frame2.to_numpy()` on a DataFrame named `frame2` with mixed data types will produce an ndarray with `dtype=object`:

```python
frame2.to_numpy()
```

The output will be similar to the following:

```
array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, -1.2],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, -1.5],
       [2003, 'Nevada', 3.2, -1.7]], dtype=object)
```

In this example, the elements in the ndarray are treated as Python objects due to the presence of mixed data types in the DataFrame columns.

In [36]:
frame3.to_numpy()

In [37]:
frame2.to_numpy()

### Index Object

Pandas' Index objects serve as containers for holding axis labels, including column names in DataFrames, along with other metadata like the axis name or names. When you construct a Series or DataFrame, any array or sequence of labels you use is internally converted to an Index object.

For instance, consider creating a Series `obj` with labels "a", "b", and "c":

```python
obj = pd.Series(np.arange(3), index=["a", "b", "c"])
```

The `index` attribute of this Series holds an Index object:

```python
index = obj.index
```

The `index` object would look like this:

```
Index(['a', 'b', 'c'], dtype='object')
```

It's important to note that Index objects are immutable, meaning they cannot be modified by the user. This immutability ensures the safety of sharing Index objects among different data structures.

```python
index[1] = "d"  # This will raise a TypeError
```

Despite immutability, Index objects offer capabilities similar to a fixed-size set. For example, you can check for the presence of a label within an Index:

```python
frame3.columns  # This returns Index(['Ohio', 'Nevada'], dtype='object', name='state')
"Ohio" in frame3.columns  # This returns True
```

However, unlike Python sets, Index objects can contain duplicate labels. When selecting with duplicate labels, all occurrences of that label will be selected.

Index objects provide a variety of methods and properties for set logic operations. Here are some useful ones:

- `append()`: Concatenate with additional Index objects, producing a new Index
- `difference()`: Compute set difference as an Index
- `intersection()`: Compute set intersection
- `union()`: Compute set union
- `isin()`: Compute a Boolean array indicating whether each value is contained in the passed collection
- `delete()`: Compute a new Index with an element at Index i deleted
- `drop()`: Compute a new Index by deleting passed values
- `insert()`: Compute a new Index by inserting an element at Index i
- `is_monotonic()`: Returns True if each element is greater than or equal to the previous element
- `is_unique()`: Returns True if the Index has no duplicate values
- `unique()`: Compute the array of unique values in the Index

These methods and properties offer valuable tools for handling and analyzing data contained within Index objects.

In [38]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])
index = obj.index
index
index[1:]

In [39]:
labels = pd.Index(np.arange(3))
labels
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2
obj2.index is labels

In [40]:
frame3
frame3.columns
"Ohio" in frame3.columns
2003 in frame3.index

In [41]:
pd.Index(["foo", "foo", "bar", "bar"])

## 5.2 Essential Functionality

This section provides a comprehensive overview of reindexing, a fundamental operation for aligning data in pandas Series and DataFrames. While the subsequent chapters will delve into more advanced data analysis and manipulation techniques, understanding reindexing lays a crucial foundation.

**Reindexing:**

Reindexing, a vital method in pandas, involves creating a new object with values rearranged to align with a new index. Let's illustrate this with examples:

Consider a Series `obj`:

```python
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
```

Calling `reindex` on this Series rearranges the data based on the new index, introducing missing values if necessary:

```python
obj2 = obj.reindex(["a", "b", "c", "d", "e"])
```

For ordered data like time series, you might need to interpolate or fill values when reindexing. The `method` option allows this, with methods like `ffill` for forward-filling:

```python
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3.reindex(np.arange(6), method="ffill")
```

In DataFrames, reindexing can alter row index, column names, or both. When given a sequence, it reindexes the rows:

```python
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=["a", "c", "d"],
                     columns=["Ohio", "Texas", "California"])
frame2 = frame.reindex(index=["a", "b", "c", "d"])
```

Columns can be reindexed using the `columns` keyword:

```python
states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)
```

To reindex a particular axis, you can pass the new labels as a positional argument and specify the axis using the `axis` keyword:

```python
frame.reindex(states, axis="columns")
```

**Table 5.3: reindex function arguments:**

This table summarizes the arguments to the `reindex` function, providing a detailed explanation for each:

- `labels`: New sequence to use as an index. Can be an Index instance or any other sequence-like Python data structure.
- `index`: Use the passed sequence as the new index labels.
- `columns`: Use the passed sequence as the new column labels.
- `axis`: Specifies the axis to reindex, whether "index" (rows) or "columns".
- `method`: Interpolation (fill) method; "ffill" fills forward, while "bfill" fills backward.
- `fill_value`: Substitute value to use when introducing missing data by reindexing.
- `limit`, `tolerance`, `level`, `copy`: Additional parameters for specifying behavior during reindexing.

Lastly, while reindexing can be done using the `reindex` method, some users prefer using the `loc` operator, especially when all new index labels already exist in the DataFrame:

```python
frame.loc[["a", "d", "c"], ["California", "Texas"]]
```

This snippet demonstrates reindexing using `loc`, which inserts missing data for new labels only if they already exist in the DataFrame.

In [2]:
import pandas as pd
import numpy as np
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [3]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [4]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [6]:
obj3.reindex(np.arange(6), method="bfill")

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [7]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=["a", "c", "d"],
                     columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [8]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [9]:
states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [10]:
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [11]:
frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

#### Dropping Entries from an Axis

The process of dropping one or more entries from an axis in pandas is straightforward, whether you're dealing with a Series or a DataFrame. If you already possess an index array or list without the entries you want to drop, you can utilize either the `reindex` method or `.loc`-based indexing. However, to streamline this process and avoid the complexities of set logic and manipulation, pandas offers the `drop` method, which conveniently returns a new object with the specified value or values removed from an axis.

**Dropping Entries from a Series:**

Let's begin with dropping entries from a Series. Consider the following example:

```python
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
```

You can drop a single entry by providing its label to the `drop` method:

```python
new_obj = obj.drop("c")
```

Or drop multiple entries by passing a list of labels:

```python
obj.drop(["d", "c"])
```

**Dropping Entries from a DataFrame:**

In a DataFrame, you can drop index values from either axis. First, let's create an example DataFrame:

```python
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
```

To drop values from the row labels (axis 0), use the `drop` method with the `index` keyword:

```python
data.drop(index=["Colorado", "Ohio"])
```

To drop labels from the columns, utilize the `columns` keyword:

```python
data.drop(columns=["two"])
```

Alternatively, you can drop values from the columns by specifying `axis=1` or `axis="columns"`:

```python
data.drop("two", axis=1)
data.drop(["two", "four"], axis="columns")
```

In summary, the `drop` method provides a convenient way to remove specified values from either the row or column axis in pandas Series and DataFrames, making data manipulation tasks more efficient and intuitive.

In [12]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [13]:
new_obj = obj.drop("c")
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [14]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [15]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [16]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [17]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [18]:
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [19]:
data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

#### Indexing, Selection, and Filtering

In pandas, Series indexing (`obj[...]`) operates similarly to NumPy array indexing. However, it introduces the ability to utilize the Series's index values instead of just integers. Here are some examples illustrating this:

```python
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])

obj["b"]        # Selecting by label
obj[1]          # Selecting by integer position
obj[2:4]        # Slicing by integer positions
obj[["b", "a", "d"]]   # Selecting multiple labels
obj[[1, 3]]     # Selecting multiple integer positions
obj[obj < 2]    # Selecting by boolean indexing
```

While using label-based selection with `[]` is possible, the preferred method is using the `loc` operator:

```python
obj.loc[["b", "a", "d"]]
```

The distinction lies in the treatment of integers when indexing with `[]`. Regular `[]` indexing treats integers as labels if the index contains integers. To address this inconsistency, pandas offers the `iloc` operator for integer-based indexing:

```python
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj1.iloc[[0, 1, 2]]
```

When using `loc`, it indexes exclusively with labels, ensuring consistency irrespective of the index's data type.

**Caution:**
Using regular `[]`-based indexing with labels may result in unexpected behavior due to the treatment of integers as labels when the index contains integers.

For DataFrame indexing, you can retrieve one or more columns using a single value or sequence:

```python
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])

data["two"]    # Retrieving a single column
data[["three", "one"]]   # Retrieving multiple columns
```

Indexing with a Boolean array or DataFrame is another common use case. For instance, you can use a Boolean array to select rows or columns based on a condition:

```python
data[:2]    # Selecting rows with slicing
data[data["three"] > 5]    # Selecting rows based on a condition
```

Moreover, you can use a Boolean DataFrame to assign values to specific locations in the DataFrame:

```python
data[data < 5] = 0    # Assigning values based on a condition
```

In summary, pandas offers versatile methods for indexing, selection, and filtering, allowing for efficient and intuitive data manipulation in Series and DataFrames.

In [4]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])
obj
obj["b"]
obj[1]
obj[2:4]
obj[["b", "a", "d"]]
obj[[1, 3]]
obj[obj < 2]

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64
1.0
1.0
c    2.0
d    3.0
dtype: float64
b    1.0
a    0.0
d    3.0
dtype: float64
b    1.0
d    3.0
dtype: float64
a    0.0
b    1.0
dtype: float64

/tmp/ipykernel_11822/1592719632.py:6: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(obj[1])
/tmp/ipykernel_11822/1592719632.py:9: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(obj[[1, 3]])

In [55]:
obj.loc[["b", "a", "d"]]

In [56]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])
obj1
obj2
obj1[[0, 1, 2]]
obj2[[0, 1, 2]]

In [57]:
obj1.iloc[[0, 1, 2]]
obj2.iloc[[0, 1, 2]]

In [58]:
obj2.loc["b":"c"]

In [59]:
obj2.loc["b":"c"] = 5
obj2

In [20]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data
data["two"]
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [21]:
data[:2]
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [22]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [23]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Selection on DataFrame with loc and iloc

In pandas, DataFrame objects have two key attributes for indexing: `loc` and `iloc`, which stand for label-based and integer-based indexing, respectively. Since a DataFrame is two-dimensional, you can use these attributes to select subsets of rows and columns using either axis labels (`loc`) or integers (`iloc`), similar to how you would with NumPy arrays.

**Using loc:**

To illustrate, let's start by selecting a single row by its label:

```python
data.loc["Colorado"]
```

This returns a Series object with the column labels of the DataFrame as its index. To select multiple rows and create a new DataFrame, you can pass a sequence of labels:

```python
data.loc[["Colorado", "New York"]]
```

You can combine row and column selection using `loc` by separating them with a comma:

```python
data.loc["Colorado", ["two", "three"]]
```

**Using iloc:**

For integer-based indexing, you can use `iloc`. For instance, to select the third row:

```python
data.iloc[2]
```

To select multiple rows or columns, provide a list of integers:

```python
data.iloc[[2, 1]]
data.iloc[2, [3, 0, 1]]
```

**Slicing:**

Both `loc` and `iloc` support slicing. For example, to select rows up to and including "Utah":

```python
data.loc[:"Utah", "two"]
```

You can also perform boolean indexing with `loc`, but not with `iloc`:

```python
data.loc[data.three >= 2]
```

**Summary of DataFrame Indexing Options:**

There are many ways to select and rearrange data in a pandas DataFrame. Table 5.4 provides a concise summary of these options:

- `df[column]`: Selects a single column or sequence of columns from the DataFrame. It also supports conveniences like boolean arrays, slices, or boolean DataFrames.
- `df.loc[rows]`: Selects a single row or subset of rows from the DataFrame by label.
- `df.loc[:, cols]`: Selects a single column or subset of columns by label.
- `df.loc[rows, cols]`: Selects both rows and columns by label.
- `df.iloc[rows]`: Selects a single row or subset of rows from the DataFrame by integer position.
- `df.iloc[:, cols]`: Selects a single column or subset of columns by integer position.
- `df.iloc[rows, cols]`: Selects both rows and columns by integer position.
- `df.at[row, col]`: Selects a single scalar value by row and column label.
- `df.iat[row, col]`: Selects a single scalar value by row and column position (integers).
- `reindex` method: Selects either rows or columns by labels.

Understanding these indexing options allows for versatile and efficient data manipulation in pandas DataFrames.

In [24]:
data
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [25]:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [26]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int64

In [27]:
data.iloc[2]
data.iloc[[2, 1]]
data.iloc[2, [3, 0, 1]]
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [29]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [28]:
data.loc[:"Utah", "two"]
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [30]:
data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Potential Issues with Integer Indexing

When working with pandas objects that are indexed by integers, it's important to be aware of potential pitfalls, especially for new users. Unlike built-in Python data structures such as lists and tuples, integer indexing in pandas operates differently and can lead to unexpected errors.

Let's consider an example with a pandas Series:

```python
ser = pd.Series(np.arange(3.))
```

Printing `ser` shows:

```
0    0.0
1    1.0
2    2.0
dtype: float64
```

Now, if we try to access an element using a negative integer index, like `-1`, which would typically retrieve the last element in a list or tuple, pandas raises an error:

```python
ser[-1]
```

The error message indicates a `KeyError`:

```
KeyError: -1
```

Pandas doesn't "fall back" on integer indexing in this case because it's challenging to do so without introducing subtle bugs into the code. The index in this Series contains `0`, `1`, and `2`, but pandas doesn't want to make assumptions about whether the user intends label-based indexing or position-based indexing.

However, with a non-integer index, such as strings, there's no ambiguity:

```python
ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])
ser2[-1]  # This returns 2.0 without error
```

In situations where the index contains integers, it's best to use `loc` (for labels) or `iloc` (for integers) to ensure clear and unambiguous data selection:

```python
ser.iloc[-1]  # This retrieves the last element
```

Similarly, slicing with integers is always integer-oriented:

```python
ser[:2]  # This returns the first two elements
```

To avoid potential issues and ensure clarity in your code, it's advisable to consistently use `loc` and `iloc` for indexing pandas objects.

In [31]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [32]:
ser[-1]

KeyError: -1

In [34]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [33]:
ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])
ser2[-1]

/tmp/ipykernel_1145/821879068.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser2[-1]

2.0

In [35]:
ser.iloc[-1]

2.0

In [36]:
ser[:2]

0    0.0
1    1.0
dtype: float64

#### Pitfalls of Chained Indexing

In the previous section, we explored how `loc` and `iloc` can be used for flexible selections on a DataFrame. While these indexing attributes are powerful, using them to modify DataFrame objects in place requires careful attention to avoid potential pitfalls.

For instance, let's consider the example DataFrame:

```python
data.loc[:, "one"] = 1
data.iloc[2] = 5
data.loc[data["four"] > 5] = 3
```

Here, we are assigning values to columns or rows by label or integer position. These operations modify the DataFrame as expected.

However, a common mistake among new pandas users is to chain selections when performing assignments:

```python
data.loc[data.three == 5]["three"] = 6
```

When executed, this might raise a `SettingWithCopyWarning`, which indicates that a value is trying to be set on a copy of a slice from the DataFrame, rather than the original DataFrame itself. This warning alerts you that you might unintentionally modify a temporary view of the data instead of the original DataFrame.

To resolve this issue and ensure that modifications are made to the original DataFrame, it's recommended to rewrite the assignment using a single `loc` operation:

```python
data.loc[data.three == 5, "three"] = 6
```

This approach ensures that the assignment is performed directly on the original DataFrame.

As a general rule, it's advisable to avoid chained indexing when performing assignments in pandas. Chained indexing can lead to unexpected behavior and potentially generate warnings like `SettingWithCopyWarning`. For more information and examples, you can refer to the relevant topic in the online pandas documentation.

In [37]:
data.loc[:, "one"] = 1
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [38]:
data.iloc[2] = 5
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [39]:
data.loc[data["four"] > 5] = 3
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [40]:
data.loc[data.three == 5]["three"] = 6

/tmp/ipykernel_1145/4274157261.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.loc[data.three == 5]["three"] = 6

In [77]:
data

In [41]:
data.loc[data.three == 5, "three"] = 6
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

### Arithmetic and Data Alignment

Arithmetic operations in pandas involve data alignment, which can simplify working with objects having different indexes. When adding objects, if any index pairs do not match, the resulting index will be the union of these index pairs.

For instance, consider two Series objects:

```python
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=["a", "c", "e", "f", "g"])
```

Adding these two Series together:

```python
s1 + s2
```

Results in:

```
a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64
```

In this result, the index "d" exists only in `s1`, "f" and "g" only in `s2`, leading to NaN values.

Similarly, for DataFrame objects, alignment occurs on both rows and columns. If DataFrame objects have non-matching row or column labels, the result will contain NaN values in those locations.

For example:

```python
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"), index=["Ohio", "Texas", "Colorado"])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"), index=["Utah", "Ohio", "Texas", "Oregon"])
```

Adding these DataFrames:

```python
df1 + df2
```

Produces:

```
            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN
```

Here, columns "c" and "e" are not found in both DataFrames, resulting in NaN values in the respective columns.

To handle missing values, you can use arithmetic methods with fill values. For instance, `df1.add(df2, fill_value=0)` will substitute 0 for any missing values during the operation.

Additionally, pandas provides flexible arithmetic methods like add, sub, div, mul, etc., each with a counterpart starting with "r" that reverses the arguments. For example, `1 / df1` is equivalent to `df1.rdiv(1)`.

When reindexing a Series or DataFrame, you can specify a fill value using the `fill_value` parameter. This allows you to replace NaN values with a custom value during the reindexing process.

In [3]:
import pandas as pd
import numpy as np
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=["a", "c", "e", "f", "g"])
s1
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [4]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [81]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
                   index=["Ohio", "Texas", "Colorado"])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                   index=["Utah", "Ohio", "Texas", "Oregon"])
df1
df2

In [82]:
df1 + df2

When adding DataFrame objects with no common column or row labels, the resulting DataFrame will contain all null values:

```python
import pandas as pd

df1 = pd.DataFrame({"A": [1, 2]})
df2 = pd.DataFrame({"B": [3, 4]})

df1 + df2
```

This produces:

```
    A   B
0 NaN NaN
1 NaN NaN
```

Both rows and columns contain only NaN values since there are no overlapping labels.

In arithmetic operations between differently indexed objects, you may want to fill missing values with a special value, such as 0. Here's an example where we replace missing values with NaN:

```python
import pandas as pd
import numpy as np

df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list("abcd"))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list("abcde"))

df2.loc[1, "b"] = np.nan

df1 + df2
```

The result is:

```
      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN
```

Here, missing values occur in locations where indexes don’t overlap. To replace missing values with a specific value, such as 0, you can use the `add` method with the `fill_value` argument:

```python
df1.add(df2, fill_value=0)
```

This yields:

```
      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0
```

All missing values have been filled with 0, providing a more structured result.

In [5]:
df1 = pd.DataFrame({"A": [1, 2]})
df2 = pd.DataFrame({"B": [3, 4]})
df1
df2
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

In [6]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list("abcd"))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list("abcde"))
df2.loc[1, "b"] = np.nan
df1
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [7]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [8]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

The table provides a summary of flexible arithmetic methods available for both Series and DataFrame objects in pandas, along with their descriptions:

| Method      | Description                                    |
|-------------|------------------------------------------------|
| add, radd   | Methods for addition (+)                       |
| sub, rsub   | Methods for subtraction (-)                    |
| div, rdiv   | Methods for division (/)                       |
| floordiv, rfloordiv | Methods for floor division (//)         |
| mul, rmul   | Methods for multiplication (*)                 |
| pow, rpow   | Methods for exponentiation (**)                |

These methods offer versatile ways to perform arithmetic operations and handle missing or differently indexed data.

For instance, when dividing 1 by a DataFrame `df1`, you can use either the `/` operator or the `div` method. The `rdiv` method performs the same operation but with reversed arguments:

```python
1 / df1
df1.rdiv(1)
```

Both yield the same result, where each element in `df1` is divided into 1. This is particularly useful when dealing with numerical data and performing element-wise operations.

Similarly, when reindexing a DataFrame `df1` with columns from another DataFrame `df2`, you can specify a fill value to replace missing entries using the `fill_value` parameter in the `reindex` method:

```python
df1.reindex(columns=df2.columns, fill_value=0)
```

This ensures that any missing columns in `df1` are filled with the specified value (in this case, 0), providing a more structured output.

In summary, these flexible arithmetic methods in pandas offer convenient ways to manipulate data, handle missing values, and perform various mathematical operations efficiently.

In [87]:
1 / df1
df1.rdiv(1)

In [10]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [9]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### Operations between DataFrame and Series

The example demonstrates the operation between a two-dimensional NumPy array (`arr`) and one of its rows. The row-wise subtraction of `arr[0]` from `arr` results in subtracting each element of the first row of `arr` from corresponding elements in each row of `arr`. Here's a breakdown:

1. We initialize a two-dimensional NumPy array `arr`:

```python
arr = np.arange(12.).reshape((3, 4))
```

This creates a 3x4 array:

```
array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])
```

2. Accessing the first row of `arr`:

```python
arr[0]
```

This retrieves the first row:

```
array([0., 1., 2., 3.])
```

3. Subtracting `arr[0]` from `arr`:

```python
arr - arr[0]
```

This operation subtracts each element of the first row of `arr` from corresponding elements in each row of `arr`. The result is:

```
array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])
```

In summary, performing arithmetic operations between a DataFrame and a Series in pandas follows a similar concept, where operations are broadcasted over rows or columns depending on the axis of the Series. This enables efficient element-wise operations between DataFrames and Series, similar to operations between NumPy arrays of different dimensions.

In [11]:
arr = np.arange(12.).reshape((3, 4))
arr
arr[0]
arr - arr[1]

array([[-4., -4., -4., -4.],
       [ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.]])

Operations involving a DataFrame and a Series are akin:

```
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])

series = frame.iloc[0]
```

Consider the DataFrame `frame`:

```
          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0
```

And the Series `series`:

```
b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64
```

The default arithmetic operation between a DataFrame and a Series aligns the Series index with the DataFrame columns, propagating the operation along the rows:

```
frame - series
```

This yields:

```
          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0
```

If an index value is absent in either the DataFrame's columns or the Series's index, the objects are reindexed to encompass the union:

```
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])

frame + series2
```

Resulting in:

```
          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN
``` 

Here, the `f` index from `series2` is absent in `frame`, thus resulting in `NaN` values.

In [13]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
series = frame.iloc[0]
frame
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [91]:
frame - series

In [14]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])
series2
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

If you aim to perform broadcasting over the columns, aligning operations on the rows, you need to utilize one of the arithmetic methods while specifying to align over the index. For instance:

```python
series3 = frame["d"]

frame
```
Produces:
```
          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0
```

And the Series `series3`:
```
Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64
```

To perform subtraction while broadcasting across the columns, aligning over the DataFrame's row index, use `sub` method specifying `axis="index"`:

```python
frame.sub(series3, axis="index")
```

This results in:
```
          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0
```

Here, the specified axis (`axis="index"`) indicates alignment over the DataFrame's row index, thus broadcasting the operation across the columns.

In [15]:
series3 = frame["d"]
frame
series3
frame.sub(series3, axis="index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function Application and Mapping

Numpy's universal functions (ufuncs), which are element-wise array methods, are also compatible with pandas objects:

```python
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])

frame
```
This generates:
```
               b         d         e
Utah   -0.204708  0.478943 -0.519439
Ohio   -0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189 -1.296221
```

When applying the absolute function (`np.abs()`), it operates element-wise on the DataFrame:

```python
np.abs(frame)
```

Resulting in:
```
               b         d         e
Utah    0.204708  0.478943  0.519439
Ohio    0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189  1.296221
```

Here, the `np.abs()` function computes the absolute value for each element in the DataFrame `frame`.

In [19]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
frame

               b         d         e
Utah   -1.052927 -0.832733  1.325769
Ohio    0.167456  0.509446  0.754604
Texas   0.632750  1.015697  0.507371
Oregon -1.604470 -0.675263 -0.678909

In [20]:
def f1(x):
    return x.max() - x.min()

frame.apply(f1)

b    2.237220
d    1.848431
e    2.004678
dtype: float64

In [21]:
frame.apply(f1, axis="columns")

Utah      2.378696
Ohio      0.587148
Texas     0.508326
Oregon    0.929206
dtype: float64

The `apply` method in pandas allows you to apply a function to one-dimensional arrays, either along columns or rows in a DataFrame:

```python
def f1(x):
    return x.max() - x.min()

frame.apply(f1)
```

This computes the difference between the maximum and minimum values for each column in the DataFrame `frame`, resulting in a Series where the columns of `frame` become the index:
```
b    1.802165
d    1.684034
e    2.689627
dtype: float64
```

By specifying `axis="columns"`, the function is applied once per row instead of per column, which can be conceptualized as "applying across the columns":

```python
frame.apply(f1, axis="columns")
```

Resulting in:
```
Utah      0.998382
Ohio      2.521511
Texas     0.676115
Oregon    2.542656
dtype: float64
```

Most common array statistics such as sum and mean have direct DataFrame methods, making the use of `apply` unnecessary in those cases.

In [22]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])
frame.apply(f2)

           b         d         e
min -1.60447 -0.832733 -0.678909
max  0.63275  1.015697  1.325769

The `apply` method in pandas can handle functions that don't necessarily return scalar values; they can also return Series with multiple values:

```python
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])

frame.apply(f2)
```

This results in:
```
            b         d         e
min -0.555730  0.281746 -1.296221
max  1.246435  1.965781  1.393406
```

Additionally, you can use element-wise Python functions. For instance, suppose you wish to format each floating-point value in `frame` as a string. You can achieve this with `applymap`:

```python
def my_format(x):
    return f"{x:.2f}"

frame.applymap(my_format)
```

Resulting in:
```
            b     d      e
Utah    -0.20  0.48  -0.52
Ohio    -0.56  1.97   1.39
Texas    0.09  0.28   0.77
Oregon   1.25  1.01  -1.30
```

The name `applymap` suggests that it applies an element-wise function across the DataFrame.

Moreover, Series objects have a `map` method for applying element-wise functions:

```python
frame["e"].map(my_format)
```

Which yields:
```
Utah      -0.52
Ohio       1.39
Texas      0.77
Oregon    -1.30
Name: e, dtype: object
```

Here, each element in the "e" column of the DataFrame `frame` is formatted as a string using the `my_format` function.

In [23]:
def my_format(x):
    return f"{x:.2f}"

frame.applymap(my_format)

/tmp/ipykernel_1274/2705683181.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  frame.applymap(my_format)

            b      d      e
Utah    -1.05  -0.83   1.33
Ohio     0.17   0.51   0.75
Texas    0.63   1.02   0.51
Oregon  -1.60  -0.68  -0.68

In [24]:
frame["e"].map(my_format)

Utah       1.33
Ohio       0.75
Texas      0.51
Oregon    -0.68
Name: e, dtype: object

### Sorting and Ranking

Sorting a dataset by specific criteria is a fundamental operation in data analysis. In pandas, you can achieve lexicographical sorting by row or column labels using the `sort_index` method, which returns a new sorted object.

For instance, with a Series, you can sort it lexicographically by index:

```python
obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])
obj.sort_index()
```
This rearranges the Series `obj`:
```
a    1
b    2
c    3
d    0
dtype: int64
```

With a DataFrame, sorting by index can be done on either axis:

```python
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=["three", "one"],
                     columns=["d", "a", "b", "c"])
frame.sort_index()
```
Result:
```
       d  a  b  c
one    4  5  6  7
three  0  1  2  3
```

Sorting by index along columns is achieved by specifying `axis="columns"`:

```python
frame.sort_index(axis="columns")
```
Output:
```
       a  b  c  d
three  1  2  3  0
one    5  6  7  4
```

By default, the data is sorted in ascending order. However, you can specify `ascending=False` to sort in descending order:

```python
frame.sort_index(axis="columns", ascending=False)
```
This yields:
```
       d  c  b  a
three  0  3  2  1
one    4  7  6  5
```

These examples demonstrate how to sort data in pandas using the `sort_index` method along rows or columns, in both ascending and descending order.

In [100]:
obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])
obj
obj.sort_index()

In [101]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=["three", "one"],
                     columns=["d", "a", "b", "c"])
frame
frame.sort_index()
frame.sort_index(axis="columns")

In [102]:
frame.sort_index(axis="columns", ascending=False)

To sort a Series by its values rather than its index, you can use the `sort_values` method:

```python
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()
```
This sorts the Series `obj` by its values:
```
2   -3
3    2
0    4
1    7
dtype: int64
```

When there are missing values, they are sorted to the end of the Series by default:

```python
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()
```
Result:
```
4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64
```

However, you can choose to sort missing values to the beginning by specifying the `na_position` option as `"first"`:

```python
obj.sort_values(na_position="first")
```
Output:
```
1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64
```

This way, missing values will appear at the start of the sorted Series.

In [103]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

In [104]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

In [105]:
obj.sort_values(na_position="first")

When sorting a DataFrame, you can use the data in one or more columns as the sort keys. To do this, you pass one or more column names to the `sort_values` method:

```python
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame.sort_values("b")
```
This sorts the DataFrame `frame` by the values in the "b" column:
```
   b  a
2 -3  0
3  2  1
0  4  0
1  7  1
```

To sort by multiple columns, you pass a list of column names to `sort_values`:

```python
frame.sort_values(["a", "b"])
```
Result:
```
   b  a
2 -3  0
0  4  0
3  2  1
1  7  1
```

This sorts the DataFrame first by the values in the "a" column, and then within each group of equal "a" values, it sorts by the values in the "b" column.

In [106]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame
frame.sort_values("b")

In [107]:
frame.sort_values(["a", "b"])

#### Ranking

Ranking assigns ranks from one through the number of valid data points in an array, starting from the lowest value. The `rank` methods for Series and DataFrame handle this; by default, ties are broken by assigning each group the mean rank:

```python
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()
```
This assigns ranks to the values in the Series `obj`:
```
0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64
```

Ranks can also be assigned based on the order they're observed in the data:

```python
obj.rank(method="first")
```
Output:
```
0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64
```

Here, instead of using the average rank (6.5) for the entries 0 and 2, they are set to 6 and 7 because label 0 precedes label 2 in the data.

Ranking can also be done in descending order:

```python
obj.rank(ascending=False)
```
Result:
```
0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64
```

Refer to Table 5.6 for a list of tie-breaking methods available.

Table 5.6: Tie-breaking methods with rank

| Method   | Description                                                                                         |
|----------|-----------------------------------------------------------------------------------------------------|
| "average"| Default: assigns the average rank to each entry in the equal group.                                |
| "min"    | Uses the minimum rank for the whole group.                                                          |
| "max"    | Uses the maximum rank for the whole group.                                                          |
| "first"  | Assigns ranks in the order the values appear in the data.                                           |
| "dense"  | Similar to method="min", but ranks always increase by 1 between groups rather than the number of   |
|          | equal elements in a group.                                                                         |

In [108]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

In [109]:
obj.rank(method="first")

In [110]:
obj.rank(ascending=False)

DataFrames can compute ranks over the rows or the columns:

```python
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
                      "c": [-2, 5, 8, -2.5]})
frame
```
This DataFrame `frame` is created:
```
     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5
```

To compute ranks over the columns, you can use the `rank` method with `axis="columns"`:

```python
frame.rank(axis="columns")
```
This generates ranks over the columns for each row:
```
     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0
```

Each value represents the rank of the corresponding element within its row, where ties are broken by the order of appearance in the row.

In [111]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
                      "c": [-2, 5, 8, -2.5]})
frame
frame.rank(axis="columns")

### Axis Indexes with Duplicate Labels

Up until now, most examples we've seen had unique axis labels (index values). While many pandas functions, like `reindex`, require unique labels, it's not mandatory. Let's explore a small Series with duplicate indices:

```python
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])
obj
```
This Series `obj` has duplicate indices:
```
a    0
a    1
b    2
b    3
c    4
dtype: int64
```

The `is_unique` property of the index can inform you whether its labels are unique:

```python
obj.index.is_unique
```
Result:
```
False
```

Data selection behaves differently with duplicates. Indexing a label with multiple entries returns a Series, while single entries return a scalar value:

```python
obj["a"]
```
Output:
```
a    0
a    1
dtype: int64

obj["c"]
```
Output:
```
4
```

This variability in output types based on label repetition can complicate your code.

The same behavior extends to indexing rows (or columns) in a DataFrame:

```python
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                  index=["a", "a", "b", "b", "c"])
df
```
Result:
```
          0         1         2
a  0.274992  0.228913  1.352917
a  0.886429 -2.001637 -0.371843
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228
c -0.577087  0.124121  0.302614
```

Indexing rows with duplicated labels returns a DataFrame:

```python
df.loc["b"]
```
Result:
```
          0         1         2
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228
```

But when the label is unique, it returns a Series:

```python
df.loc["c"]
```
Result:
```
0   -0.577087
1    0.124121
2    0.302614
Name: c, dtype: float64
```

This behavior highlights the importance of handling duplicate labels appropriately in your data analysis workflow.

In [112]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])
obj

In [113]:
obj.index.is_unique

In [114]:
obj["a"]
obj["c"]

In [115]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                  index=["a", "a", "b", "b", "c"])
df
df.loc["b"]
df.loc["c"]

## 5.3 Summarizing and Computing Descriptive Statistics

Pandas objects come with a variety of mathematical and statistical methods, mostly falling into the category of reductions or summary statistics. These methods extract a single value (like the sum or mean) from a Series or a Series of values from the rows or columns of a DataFrame. Compared to similar methods found on NumPy arrays, pandas methods have built-in handling for missing data. Let's explore these using a small DataFrame:

```python
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])
df
```
This DataFrame `df` contains some NaN values:
```
    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3
```

Calling DataFrame's `sum` method returns a Series containing column sums:

```python
df.sum()
```
Output:
```
one    9.25
two   -5.80
dtype: float64

Passing `axis="columns"` or `axis=1` sums across the columns instead:

```python
df.sum(axis="columns")
```
Output:
```
a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

When an entire row or column contains all NA values, the sum is 0. If any value is not NA, then the result is NA. This behavior can be changed with the `skipna` option:

```python
df.sum(axis="index", skipna=False)
```
Output:
```
one   NaN
two   NaN
dtype: float64

```python
df.sum(axis="columns", skipna=False)
```
Output:
```
a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

Some aggregations, like `mean`, require at least one non-NA value to yield a valid result:

```python
df.mean(axis="columns")
```
Output:
```
a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64
```

Refer to Table 5.7 for a list of common options available for each reduction method.

Here's Table 5.7 with options for reduction methods:

| Method | Description                                                                                           |
|--------|-------------------------------------------------------------------------------------------------------|
| axis   | Axis to reduce over; "index" for DataFrame's rows and "columns" for columns                           |
| skipna | Exclude missing values; True by default                                                               |
| level  | Reduce grouped by level if the axis is hierarchically indexed (MultiIndex)                             |

In [3]:
import pandas as pd
import numpy as np
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [117]:
df.sum()

In [118]:
df.sum(axis="columns")

In [119]:
df.sum(axis="index", skipna=False)
df.sum(axis="columns", skipna=False)

In [120]:
df.mean(axis="columns")

Some methods in pandas, like `idxmin` and `idxmax`, return indirect statistics, providing the index value where the minimum or maximum values are attained:

```python
df.idxmax()
```
Output:
```
one    b
two    d
dtype: object
```

Other methods, such as `cumsum`, perform accumulations:

```python
df.cumsum()
```
Output:
```
    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8
```

Some methods neither reduce nor accumulate. `describe` is one such example, producing multiple summary statistics in one shot:

```python
df.describe()
```
Output:
```
            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000
```

On non-numeric data, `describe` produces alternative summary statistics:

```python
obj = pd.Series(["a", "a", "b", "c"] * 4)
obj.describe()
```
Output:
```
count     16
unique     3
top        a
freq       8
dtype: object
```

These methods provide various ways to summarize and analyze your data efficiently.

Here's Table 5.8 with a full list of descriptive and summary statistics methods and their descriptions:

| Method      | Description                                                                                        |
|-------------|----------------------------------------------------------------------------------------------------|
| count       | Number of non-NA values                                                                            |
| describe    | Compute a set of summary statistics                                                                |
| min, max    | Compute the minimum and maximum values                                                             |
| argmin, argmax | Compute the index locations (integers) at which the minimum or maximum value is obtained, respectively; not available on DataFrame objects |
| idxmin, idxmax | Compute the index labels at which the minimum or maximum value is obtained                       |
| quantile    | Compute a sample quantile ranging from 0 to 1 (default: 0.5)                                        |
| sum         | Sum of values                                                                                      |
| mean        | Mean of values                                                                                    |
| median      | Arithmetic median (50% quantile) of values                                                        |
| mad         | Mean absolute deviation from the mean value                                                        |
| prod        | Product of all values                                                                             |
| var         | Sample variance of values                                                                         |
| std         | Sample standard deviation of values                                                                |
| skew        | Sample skewness (third moment) of values                                                           |
| kurt        | Sample kurtosis (fourth moment) of values                                                          |
| cumsum      | Cumulative sum of values                                                                          |
| cummin, cummax | Cumulative minimum or maximum of values, respectively                                             |
| cumprod     | Cumulative product of values                                                                      |
| diff        | Compute the first arithmetic difference (useful for time series)                                   |
| pct_change  | Compute percent changes                                                                           |

These methods provide a comprehensive set of tools for analyzing and summarizing data in pandas.

In [121]:
df.idxmax()

In [122]:
df.cumsum()

In [123]:
df.describe()

In [124]:
obj = pd.Series(["a", "a", "b", "c"] * 4)
obj.describe()

#### Correlation and Covariance

Certain summary statistics, such as correlation and covariance, require data pairs for computation. Let's consider DataFrames representing stock prices and volumes sourced from Yahoo! Finance and stored in binary Python pickle files.

```python
price = pd.read_pickle("examples/yahoo_price.pkl")
volume = pd.read_pickle("examples/yahoo_volume.pkl")
```

Next, let's compute the percent changes in prices, a time series operation that will be explored further in Chapter 11:

```python
returns = price.pct_change()
```

Here's a snippet of the resulting DataFrame:

```
                AAPL      GOOG       IBM      MSFT
Date                                              
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096
```

The `corr` method of a Series calculates the correlation between overlapping, non-missing, aligned-by-index values in two Series. Similarly, the `cov` method computes the covariance:

```python
returns["MSFT"].corr(returns["IBM"])
returns["MSFT"].cov(returns["IBM"])
```

The correlation between "MSFT" and "IBM" turns out to be approximately 0.4998, while the covariance is about 8.87e-05.

In [4]:
price = pd.read_pickle("examples/yahoo_price.pkl")
volume = pd.read_pickle("examples/yahoo_volume.pkl")
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [5]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [7]:
returns["MSFT"].corr(returns["IBM"])
# returns["MSFT"].cov(returns["IBM"])

0.49976361144151144

On the other hand, DataFrame's `corr` and `cov` methods provide comprehensive correlation and covariance matrices as DataFrames, respectively:

In [8]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [9]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215


These methods offer a consolidated view of the relationships between the columns, providing insights into how changes in one stock's price may correlate with changes in another's, or how the volatility of one stock relates to another.

Using DataFrame’s `corrwith` method, you can calculate pair-wise correlations between a DataFrame’s columns or rows and another Series or DataFrame. 

When you pass a Series, it returns a Series with correlation values computed for each column:

```python
returns.corrwith(returns["IBM"])
```
Output:
```
AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64
```

Passing a DataFrame computes correlations of matching column names. For instance, you can calculate correlations of percent changes with volume:

```python
returns.corrwith(volume)
```
Output:
```
AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64
```

Passing `axis="columns"` performs calculations row-by-row instead. In all cases, the data points are aligned by label before the correlation is computed. This method provides a convenient way to analyze the relationship between different columns or rows in your dataset.

In [129]:
returns.corrwith(returns["IBM"])

In [130]:
returns.corrwith(volume)

### Unique Values, Value Counts, and Membership

Another set of methods provides insights into the values contained within a one-dimensional Series. Let's illustrate this with an example:

```python
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])
```

The first function, `unique`, returns an array of the unique values in a Series:

```python
uniques = obj.unique()
```
Output:
```
array(['c', 'a', 'd', 'b'], dtype=object)
```

The unique values are not necessarily returned in the order they first appear, nor in sorted order, but they could be sorted after the fact if needed (`uniques.sort()`). 

Relatedly, `value_counts` computes a Series containing value frequencies:

```python
obj.value_counts()
```
Output:
```
c    3
a    3
b    2
d    1
Name: count, dtype: int64
```

The Series is sorted by value in descending order as a convenience. `value_counts` is also available as a top-level pandas method that can be used with NumPy arrays or other Python sequences:

```python
pd.value_counts(obj.to_numpy(), sort=False)
```
Output:
```
c    3
a    3
d    1
b    2
Name: count, dtype: int64
```

These methods offer valuable insights into the distribution of values within a Series, making it easier to understand the data at a glance.

In [131]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])

In [132]:
uniques = obj.unique()
uniques

In [133]:
obj.value_counts()

In [134]:
pd.value_counts(obj.to_numpy(), sort=False)

The `isin` method performs a vectorized set membership check, which is useful for filtering a dataset down to a subset of values in a Series or column in a DataFrame:

```python
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])

mask = obj.isin(["b", "c"])

obj[mask]
```
Output:
```
0    c
5    b
6    b
7    c
8    c
dtype: object
```

The `mask` variable here contains boolean values indicating whether each element of the Series `obj` is present in the specified list `["b", "c"]`. Applying this mask to the original Series results in a filtered Series containing only the elements that match the condition.

Related to `isin` is the `Index.get_indexer` method, which provides an index array from an array of possibly non-distinct values into another array of distinct values:

```python
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])
unique_vals = pd.Series(["c", "b", "a"])

indices = pd.Index(unique_vals).get_indexer(to_match)
```
Output:
```
array([0, 2, 1, 1, 0, 2])
```

Here, the `indices` array indicates the index positions of each value in the `to_match` Series within the `unique_vals` Series. This can be useful for mapping values between two Series or arrays.

Here's a reference table summarizing the unique, value counts, and set membership methods:

Table 5.9: Unique, value counts, and set membership methods

| Method       | Description                                                                                      |
|--------------|--------------------------------------------------------------------------------------------------|
| isin         | Computes a Boolean array indicating whether each Series or DataFrame value is contained in the passed sequence of values |
| get_indexer  | Computes integer indices for each value in an array into another array of distinct values; helpful for data alignment and join-type operations |
| unique       | Computes an array of unique values in a Series, returned in the order observed                   |
| value_counts | Returns a Series containing unique values as its index and frequencies as its values, ordered count in descending order |

These methods are commonly used for filtering, data alignment, and obtaining insights into the distribution of values within a Series or DataFrame.

In [135]:
obj
mask = obj.isin(["b", "c"])
mask
obj[mask]

In [136]:
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])
unique_vals = pd.Series(["c", "b", "a"])
indices = pd.Index(unique_vals).get_indexer(to_match)
indices

In certain scenarios, you might find it necessary to compute a histogram across multiple related columns within a DataFrame. Here's an illustration:

```python
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
                     "Qu2": [2, 3, 1, 2, 3],
                     "Qu3": [1, 5, 2, 4, 4]})
```

Let's take a look at the DataFrame:

```python
data
```
```
   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4
```

We can compute the value counts for a single column, for example, "Qu1", like this:

```python
data["Qu1"].value_counts().sort_index()
```
```
Qu1
1    1
3    2
4    2
Name: count, dtype: int64
```

This gives us the frequency counts of each unique value in the "Qu1" column, sorted by index.

In [137]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
                     "Qu2": [2, 3, 1, 2, 3],
                     "Qu3": [1, 5, 2, 4, 4]})
data

In [138]:
data["Qu1"].value_counts().sort_index()

To compute the frequency counts for all columns, you can utilize the `apply` method of the DataFrame, passing `pd.value_counts`, and then filling any missing values with 0:

```python
result = data.apply(pd.value_counts).fillna(0)
```

This will give you a DataFrame where the row labels represent the distinct values occurring across all columns, and the values represent the respective counts of these values in each column:

```python
   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0
```

Additionally, there exists a `DataFrame.value_counts` method, but it computes counts by treating each row of the DataFrame as a tuple to determine the occurrences of each distinct row:

```python
data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})
```

```python
data.value_counts()
```

This yields a result with an index representing distinct rows as a hierarchical index:

```
a  b
1  0    2
2  0    2
1  1    1
Name: count, dtype: int64
```

The hierarchical index signifies a tuple of values representing each row, which is a topic we will delve into further in Chapter 8: Data Wrangling: Join, Combine, and Reshape.

In [139]:
result = data.apply(pd.value_counts).fillna(0)
result

In [140]:
data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})
data
data.value_counts()

In [142]:
pd.options.display.max_rows = PREVIOUS_MAX_ROWS